read_verilog $::env(TOPLEVEL_FILE)
hierarchy -libdir ../source/clk
            -libdir ../source/dds
            -libdir ../source/fifo
            -libdir ../source/i2s
            -libdir ../source/ram
            -libdir ../source/uart
synth_ice40 -noflatten
write_blif fpga-audio.blif
write_json fpga-audio.json